# Урок номер 8 строки

x = 123454321
x = str(x)
print("Конвертация в строку:", x)
print("Повторение строки:", x*10)
print("Сравнение строк abc > x :", "abc" > "x")
print("Сравнение строк a > b:", "a" > "B")
print("Код символа:", ord(" "))
print("Поиск позиции символа в строке:", x.find("4"))
print("Точный поиск позиции символа в строке:", x.index("4"))
print("Поиск позиции с конца символа в строке:", x.rfind("4"))
print("Поиск позиции символа в диапозоне:", x.rfind("4", 4, 6))
print()

print("Замена символа:", x.replace("4", "ж"))
print("Замена символа:", x.replace("5", ""))
print("Замена символа указанное кол-во раз:", x.replace("3", "зет", 2))
print()

x = "AAAAA ooooo"
print("Перевод в заглавные", x.upper())
print("Перевод в прописные", x.lower())
print("Перевод в прописные", x.lower())
print("Слова с большой буквы", x.title())
print("Предложение с большой буквы", x.capitalize())
print()

x = "123454321"
print("Подсчет совпадений", x.count("4"))
print("Подсчет совпадений в диапозоне", x.count("4", 1, 5))
print("Проверка строки на число", x.isdigit())
x = "qwerty"
print("Проверка строки на букву", x.isalpha())
x = "1 2 21 45 84 89 74"
print("Ковертация строки в список", x.split())
x = ["a", "b", "c"]
y = "*".join(x)
print("Ковертация списка в строку", y)


input()