arr = list(map(int, input().split()))
arr.sort()
arr.reverse()
print(arr[0] * arr[1] * arr[2])

#Дана строка, в которой через пробел написаны натуральные числа. Напишите программу, которая выводит наибольшее произведение трех чисел их данного ряда.

#Входные данные: строка чисел через пробел

#Выходные данные: наибольшее произведение из трех чисел

#Пример входных данных: 1 4 3 2

#Пример выходных данных: 24
